acc1072.АвтоматизацияИнформированияДебиторов/src/Catalogs/Аид_ШаблоныСообщений/Аид_ШаблоныСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Аид_ШаблоныСообщений</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецШаблона</name>
    <type>
      <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
    </type>
  </attributes>
  <attributes>
    <name>ВнешняяОбработка</name>
    <type>
      <types>CatalogRef.ДополнительныеОтчетыИОбработки</types>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтправлятьВТранслите</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяТипаПараметраВводаНаОсновании</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредназначенДляSMS</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредназначенДляВводаНаОсновании</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредназначенДляЭлектронныхПисем</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстШаблонаSMS</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстШаблонаПисьма</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстШаблонаПисьмаHTML</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемаПисьма</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипТекстаПисьма</name>
    <type>
      <types>EnumRef.СпособыРедактированияЭлектронныхПисем</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоДляАвтора</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранслитерироватьИменаФайлов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УпаковатьВАрхив</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматВложений</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонПоВнешнейОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписьИПечать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Аид_ПредназначенДляГолосовогоСообщения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Аид_Прощание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПечатныеФормыИВложения</name>
    <attributes>
      <name>Идентификатор</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ПредставлениеПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

acc1072.АвтоматизацияИнформированияДебиторов/src/Enums/Аид_ТипыСообщений/Аид_ТипыСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Аид_ТипыСообщений</name>
  <enumValues>
    <name>Email</name>
  </enumValues>
  <enumValues>
    <name>SMS</name>
  </enumValues>
  <enumValues>
    <name>ГолосовоеСообщение</name>
  </enumValues>
</mdclass:Enum>

acc1072.АвтоматизацияИнформированияДебиторов/src/Catalogs/Аид_ШаблоныСообщений/Forms/Аид_ФормаВыбора/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ТипСообщения", ЭтотОбъект.ТипСообщенияОтбор) тогда
		Если ЭтотОбъект.ТипСообщенияОтбор = Перечисления.Аид_ТипыСообщений.Email тогда
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						Список,"ПредназначенДляЭлектронныхПисем",Истина,,,Истина);
		ИначеЕсли ЭтотОбъект.ТипСообщенияОтбор = Перечисления.Аид_ТипыСообщений.SMS тогда	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						Список,"ПредназначенДляSMS",Истина,,,Истина);
		ИначеЕсли ЭтотОбъект.ТипСообщенияОтбор = Перечисления.Аид_ТипыСообщений.ГолосовоеСообщение тогда	
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
						Список,"Аид_ПредназначенДляГолосовогоСообщения",Истина,,,Истина);
		иначе
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПредназначенДляЭлектронныхПисем");
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ПредназначенДляSMS");
			ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Аид_ПредназначенДляГолосовогоСообщения");
		КонецЕсли;
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список,"Назначение","АИД",,,Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	к = 1;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	к = 1;
КонецПроцедуры

&НаКлиенте
Процедура СписокОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	к = 1;
	//ПараметрыФормы = Новый Структура();
	//ПараметрыФормы.Вставить("ВидСообщения",           ТипСообщения);
	//ПараметрыФормы.Вставить("ПолноеИмяТипаОснования", Назначение);
	//ПараметрыФормы.Вставить("МожноМенятьНазначение",  Истина);
	//ОткрытьФорму("Справочник.ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	к = 1;
КонецПроцедуры

&НаКлиенте
Процедура СоздатьШаблон(Команда)
	ВидСообщения = "";
	Если ТипСообщенияОтбор = ПредопределенноеЗначение("Перечисление.Аид_ТипыСообщений.ГолосовоеСообщение") Тогда
		ВидСообщения = "ГолосовоеСообщение";
	ИначеЕсли ТипСообщенияОтбор = ПредопределенноеЗначение("Перечисление.Аид_ТипыСообщений.SMS") Тогда
		ВидСообщения = "СообщениеSMS";
	ИначеЕсли ТипСообщенияОтбор = ПредопределенноеЗначение("Перечисление.Аид_ТипыСообщений.Email") Тогда
		ВидСообщения = "Почта";
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ВидСообщения", ВидСообщения);
	ПараметрыФормы.Вставить("ЭтоАИД",       Истина);
	ОткрытьФорму("Справочник.Аид_ШаблоныСообщений.ФормаОбъекта", ПараметрыФормы, ЭтотОбъект);
КонецПроцедуры
